```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
  ~ update in-place
-   destroy

Terraform will perform the following actions:

  # aws_s3_object.static_files["asset-manifest.json"] will be updated in-place
  ~ resource "aws_s3_object" "static_files" {
      ~ etag               = "c1e1dacbe1d9885f87a42834c3bd80d1" -> "07a5465b50831deef82b07b5f2857966"
        id                 = "asset-manifest.json"
        tags               = {}
+       version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.static_files["index.html"] will be updated in-place
  ~ resource "aws_s3_object" "static_files" {
      ~ etag               = "6d3304efc593ae25ef1e3473726ede34" -> "37feae1c2a3f3a3383bb62930b10db44"
        id                 = "index.html"
        tags               = {}
+       version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.static_files["static/css/main.22941023.css"] will be destroyed
  # (because key ["static/css/main.22941023.css"] is not in for_each map)
-   resource "aws_s3_object" "static_files" {
-       acl                = "private" -> null
-       bucket             = "aws-hosted-react-staging" -> null
-       bucket_key_enabled = false -> null
-       content_type       = "text/css; charset=utf-8" -> null
-       etag               = "7e5c16e8be85f95f19fa9f527faf0810" -> null
-       force_destroy      = false -> null
-       id                 = "static/css/main.22941023.css" -> null
-       key                = "static/css/main.22941023.css" -> null
-       metadata           = {} -> null
-       source             = "../react-build/static/css/main.22941023.css" -> null
-       storage_class      = "STANDARD" -> null
-       tags               = {} -> null
-       tags_all           = {} -> null
    }

  # aws_s3_object.static_files["static/css/main.22941023.css.map"] will be destroyed
  # (because key ["static/css/main.22941023.css.map"] is not in for_each map)
-   resource "aws_s3_object" "static_files" {
-       acl                = "private" -> null
-       bucket             = "aws-hosted-react-staging" -> null
-       bucket_key_enabled = false -> null
-       content_type       = "application/octet-stream" -> null
-       etag               = "506c1a1be725c33b46e2b7aef1bb1476" -> null
-       force_destroy      = false -> null
-       id                 = "static/css/main.22941023.css.map" -> null
-       key                = "static/css/main.22941023.css.map" -> null
-       metadata           = {} -> null
-       source             = "../react-build/static/css/main.22941023.css.map" -> null
-       storage_class      = "STANDARD" -> null
-       tags               = {} -> null
-       tags_all           = {} -> null
    }

  # aws_s3_object.static_files["static/css/main.c9c8a4e7.css"] will be created
+   resource "aws_s3_object" "static_files" {
+       acl                    = "private"
+       bucket                 = "aws-hosted-react-staging"
+       bucket_key_enabled     = (known after apply)
+       content_type           = "text/css; charset=utf-8"
+       etag                   = "1f2f1674809c755f4ca23b05e5a9f992"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "static/css/main.c9c8a4e7.css"
+       kms_key_id             = (known after apply)
+       server_side_encryption = (known after apply)
+       source                 = "../react-build/static/css/main.c9c8a4e7.css"
+       storage_class          = (known after apply)
+       tags_all               = (known after apply)
+       version_id             = (known after apply)
    }

  # aws_s3_object.static_files["static/css/main.c9c8a4e7.css.map"] will be created
+   resource "aws_s3_object" "static_files" {
+       acl                    = "private"
+       bucket                 = "aws-hosted-react-staging"
+       bucket_key_enabled     = (known after apply)
+       content_type           = "application/octet-stream"
+       etag                   = "84acb3d7c48ea6844a8c384dea877ba8"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "static/css/main.c9c8a4e7.css.map"
+       kms_key_id             = (known after apply)
+       server_side_encryption = (known after apply)
+       source                 = "../react-build/static/css/main.c9c8a4e7.css.map"
+       storage_class          = (known after apply)
+       tags_all               = (known after apply)
+       version_id             = (known after apply)
    }

Plan: 2 to add, 2 to change, 2 to destroy.
```